{"/de/community/":{"data":{"":"","ankündigungen#Ankündigungen":" Abonnieren Sie die [Mailing-Liste] für Veröffentlichungsankündigungen ","entwicklung#Entwicklung":" In der Regolith GitHub org findet die Entwicklung statt. ","hilfe-und-austausch#Hilfe und Austausch":" Besuchen Sie uns auf [GitHub Discussions] für Hilfe und Gespräche (auf Englisch) Chat with community members on the Regolith Desktop [Matrix space] Suchen Sie in bestehenden Tickets oder erstellen Sie [ein neues Ticket] für Bugs und Funktionswünsche (auf Englisch) ","support-regolith#Support Regolith":"\nBecome a financial [contributor] and help us sustain our community "},"title":"Community"},"/de/docs/":{"data":{"":"","getting-started#Getting Started":" Install Regolith Basic Usage Configuration ","usefull-references#Usefull References":" Keybindings Config Files Xresources "},"title":"Documentation"},"/de/docs/getting-started/":{"data":{"":"Explore the following sections to learn more about Regolith:\nUsing RegolithContent about how to use the Regolith Desktop How ToSome examples of how you can customize Regolith Linux ReferenceReference material "},"title":"Getting Started"},"/de/docs/howtos/":{"data":{"":" This page was copied from the Regolith 1.x website and has not been updated for Regolith 2. It may contain out of date information. More examples and tutorials are available in the regolith-desktop wiki on GitHub. ","i3-wm-user-guide#i3-wm User Guide":"In addition to general command-line abilities, having a basic understanding of what options are available in the i3 user guide is recommended to get the most out of the interface.","using-the-terminal#Using the Terminal":"This section provides examples of how to change Regolith to suit your needs. Most of them will specify commands to be run in the terminal. If using the terminal is new to you or you’d just like to refresh your memory, this guide from Ubuntu is recommended. Another tutorial from linuxcommand.org goes into some more advanced territory."},"title":"How To"},"/de/docs/howtos/add-remove-blocklets/":{"data":{"":"","adding-or-removing-status-indicators#Adding or Removing status indicators":"","customize-bar#Customization of the i3 bar":"Adding or Removing status indicators Finding Status Indicators apt search i3xrocks- Installing a Status Indicator sudo apt install i3xrocks-memory regolith-look refresh Customization of the i3 bar Each status indicator on the bar is managed by a file. The name of the file maps to the position of the status indicator on the bar, e.g. a file’s name starting with 10_ mean its corresponding indicator will be positioned before an indicator which has a configuration file starting with 20_. Within each file there is some information that i3xrocks uses to execute a script that ultimately returns the data you see on the bar. Some of the status indicators have configuration parameters that can be adjusted to your liking. For example, if you would prefer that the battery status changes more frequently, the polling interval can be updated. The first thing to do in order to customize the bar is to copy the indicators you wish to see from /usr/share/i3xrocks/conf.d/ to ~/.config/regolith3/i3xrocks/conf.d. Each file in ~/.config/regolith3/i3xrocks/conf.d can be modified as you see fit. To change the order of status indicators on the bar, simply change the name of the files to the sort order you prefer.\nOnce you’ve made your changes, refreshing the session should cause the bar to update based on your new configuration.\nFor example, to change the order of the battery and net traffic blocks on the bar and not display notifications, perform the following steps:\n$ ls /usr/share/i3xrocks/conf.d/ 01_setup 30_net-traffic 80_battery 80_rofication 90_time $ mkdir -p ~/.config/regolith3/i3xrocks/conf.d $ cd /usr/share/i3xrocks/conf.d/ $ cp 01_setup ~/.config/regolith3/i3xrocks/conf.d/01_setup $ cp 80_battery ~/.config/regolith3/i3xrocks/conf.d/30_battery $ cp 30_net-traffic ~/.config/regolith3/i3xrocks/conf.d/80_net-traffic $ regolith-look refresh Note: If any block configuration exists in the user directory ~/.config/regolith3/i3xrocks/conf.d, then the defaults in /usr/share/i3xrocks/conf.d/ will be ignored.","further-reading#Further Reading":"The reference page for configurations has more details about the configuration files used with Regolith Linux."},"title":"Change Bar Status indicators"},"/de/docs/reference/":{"data":{"":"This section contains reference material that may help you with Regolith.\nKeybindings Config Files i3xrocks Xresources Release Notes "},"title":"Reference"},"/de/docs/reference/configurations/":{"data":{"":" Component Default Config User Config Notes i3 / i3-gaps /etc/regolith/i3/config ~/.config/regolith3/i3/config (global override) i3 config partials live in /usr/share/regolith/i3/config.d Xresources /usr/share/regolith-look/default ~/.config/regolith3/Xresources ~/.Xresources is also loaded but intended for properties that may also be required in other desktop sessions. Bar status indicators /usr/share/i3xrocks/conf.d/ ~/.config/regolith3/i3xrocks/conf.d Each block has it’s own file. Filename determines ordering. Picom (Compton) Compositor /etc/regolith/picom/config ~/.config/regolith3/picom/config Adding an i3 config file in ~/.config/regolith3/i3/config will essentially override all Regolith configuration including Xresources and looks. "},"title":"Config Files"},"/de/docs/reference/releases/":{"data":{"":"Release notes and other version-specific content can be found here.\n3.2 Release Notes 3.1 Release Notes 3.0 Release Notes 2.2 Release Notes 2.1 Release Notes 2.0 Release Notes 1.6 Release Notes 1.5.3 Release Notes 1.5.2 Release Notes 1.5.1 Release Notes 1.5 Release Notes 1.4.1 Release Notes 1.4 Release Notes 1.3.1 Release Notes 1.3 Release Notes "},"title":"Releases"},"/de/docs/reference/xresources/":{"data":{"":"","main-xresources-keys#Main \u003ccode\u003eXresources\u003c/code\u003e keys":"","optional-xresources-keys#Optional \u003ccode\u003eXresources\u003c/code\u003e keys":" Regolith version 3.0 onward replaces “i3-wm” with “wm” in Xresource keys. The content on this page has been updated for Regolith 3.0+. If you are using an earlier version, use “i3-wm” instead of “wm” in the key names below. For example wm.foo.bar changes to i3-wm.foo.bar for Regolith 1.x and 2.x. Main Xresources keys Xresources Key Description gtk.theme_name GTK Theme (“Legacy Applications” in gnome-tweaks) gtk.icon_theme_name GTK Icon Theme gnome.terminal.audible-bell Enables audible bell in gnome-terminal (true / false) gtk.document_font_name GTK Document Font Name gtk.font_name General purpose font for GTK apps and the desktop gtk.monospace_font_name Font for monospace areas such as i3bar and the terminal gnome.terminal.background-transparency-percent Background transparency value for gnome-terminal (0 - 100). See also gnome.terminal.use-transparent-background. gnome.terminal.font Font definition for gnome-terminal gnome.terminal.scrollbar Flag to enable/disable scrollbar (never / always) gnome.terminal.use-transparent-background Enables transparent background in gnome-terminal (true / false). See also gnome.terminal.background-transparency-percent. gnome.wallpaper GNOME Wallpaper (can be overridden in Settings) gnome.wm.theme GNOME Window Manager Theme (unused) wm.alt Key mapping for Alt key. See the i3 User Guide for details. wm.bar.background.color Bar Background Color wm.bar.position Bar Screen Position wm.bar.separator.color Color of seperator between blocks wm.bar.statusline.color wm.bar.trayoutput Enable or disable the app tray in i3bar wm.bar.workspace.active.background.color wm.bar.workspace.active.border.color wm.bar.workspace.active.text.color wm.bar.workspace.focused.background.color wm.bar.workspace.focused.border.color wm.bar.workspace.focused.text.color wm.bar.workspace.inactive.background.color wm.bar.workspace.inactive.border.color wm.bar.workspace.inactive.text.color wm.bar.workspace.urgent.background.color wm.bar.workspace.urgent.border.color wm.bar.workspace.urgent.text.color wm.client.focused.color.background wm.client.focused.color.border wm.client.focused.color.child_border wm.client.focused.color.indicator wm.client.focused.color.text wm.client.focused_inactive.color.background wm.client.focused_inactive.color.border wm.client.focused_inactive.color.child_border wm.client.focused_inactive.color.indicator wm.client.focused_inactive.color.text wm.client.unfocused.color.background wm.client.unfocused.color.border wm.client.unfocused.color.child_border wm.client.unfocused.color.indicator wm.client.unfocused.color.text wm.client.urgent.color.background wm.client.urgent.color.border wm.client.urgent.color.child_border wm.client.urgent.color.indicator wm.client.urgent.color.text wm.floatingwindow.border.size Window border size in pixels for floating windows wm.font Window manager font wm.gaps.inner.size Default gap size between windows in pixels wm.gaps.outer.size Default gap size at screen edge in pixels wm.mod Key mapping for Super key. See the i3 User Guide for details. wm.window.border.size Default border size in pixels wm.workspace.01.name .. wm.workspace.19.name Workspace Labels wm.workspace.01.key .. wm.workspace.10.key Workspace Shortucts i3xrocks.action.volume.left Command to execute when volume indicator is left clicked (default: none) i3xrocks.action.volume.middle Command to execute when volume indicator is middle clicked (default: none) i3xrocks.action.volume.right Command to execute when volume indicator is right clicked (default: mute through amixer) i3xrocks.action.volume.scrollup Command to execute when scroll wheel up is used on volume indicator (default: increase volume through amixer) i3xrocks.action.volume.scrolldn Command to execute when scroll wheel down is used on volume indicator (default: decrease volume through amixer) i3xrocks.error.color Color for bar module in error mode i3xrocks.label.battery0 Bar icon glyph i3xrocks.label.battery100 Bar icon glyph i3xrocks.label.battery20 Bar icon glyph i3xrocks.label.battery50 Bar icon glyph i3xrocks.label.battery80 Bar icon glyph i3xrocks.label.batteryac Bar icon glyph i3xrocks.label.batterycharging Bar icon glyph i3xrocks.label.batteryunknown Bar icon glyph i3xrocks.label.capslock Bar icon glyph i3xrocks.label.color Bar icon glyph i3xrocks.label.cpu Bar icon glyph i3xrocks.label.disk Bar icon glyph i3xrocks.label.dn Bar icon glyph i3xrocks.label.help Bar icon glyph i3xrocks.label.mediapaused Bar icon glyph i3xrocks.label.mediaplaying Bar icon glyph i3xrocks.label.memory Bar icon glyph i3xrocks.label.mute Bar icon glyph i3xrocks.label.notify.error Bar icon glyph i3xrocks.label.notify.none Bar icon glyph i3xrocks.label.notify.some Bar icon glyph i3xrocks.label.numlock Bar icon glyph i3xrocks.label.off Bar icon glyph i3xrocks.label.on Bar icon glyph i3xrocks.label.sound Bar icon glyph i3xrocks.label.thermometer Bar icon glyph i3xrocks.label.time Bar icon glyph i3xrocks.label.up Bar icon glyph i3xrocks.label.wifi Bar icon glyph i3xrocks.label.wired Bar icon glyph i3xrocks.nominal Default bar icon color i3xrocks.value.color Color of numerical value in bar module i3xrocks.value.font Font for numerical value in bar module i3xrocks.warning Warning color for bar module Optional Xresources keys The following Xresources keys are undefined by default but can be used by users to change behavior as desired.\nXresources Key Description wm.gaps.focus_follows_mouse The window under the mouse has focus if enabled wm.program.launcher.app Command i3 executes from the app launcher keybinding wm.program.launcher.cmd Command i3 executes from the command launcher keybinding wm.program.launcher.window Command i3 executes for the window navigation keybinding wm.program.help Command to launch from the help keybinding wm.program.file_search Command to launch from the file search keybinding wm.program.refresh_ui Command to launch from the session refresh keybinding wm.program.logout Command to launch from the logout keybinding wm.program.reboot Command to launch from the reboot keybinding wm.program.shutdown Command to launch from the shutdown keybinding wm.program.lock Command to launch from the lock screen keybinding wm.program.sleep Command to launch from the sleep keybinding wm.program.settings Command to launch from the Control Panel keybinding wm.program.display Command to launch from the Display Settings keybinding wm.program.wifi Command to launch from the Wifi Settings keybinding wm.program.bluetooth Command to launch from the Bluetooth Settings keybinding wm.program.files Command to launch from the file browser keybinding wm.program.notification_ui Command to launch from the notification UI keybinding wm.program.1…wm.program.3 Optional programs to start with i3 i3xrocks.media-player.player-args Optional arguments used by the media-player i3xrocks block. These arguments are fed straight into playerctl, eg. setting this value to -p spotify only makes the bar display/control spotify. i3xrocks.action.mic.left Optional command to run on left button click of microphone status indicator. i3xrocks.action.mic.middle Optional command to run on middle button click of microphone status indicator. i3xrocks.action.mic.right Override command to run on right button click of microphone status indicator. i3xrocks.action.mic.scrollup Override command to run on scroll up of microphone status indicator. i3xrocks.action.mic.scrolldn Override command to run on scroll down of microphone status indicator. i3xrocks.action.volume.left Optional command to run on left button click of microphone status indicator. i3xrocks.action.volume.middle Optional command to run on middle button click of microphone status indicator. i3xrocks.action.volume.right Override command to run on right button click of microphone status indicator. i3xrocks.action.volume.scrollup Override command to run on scroll up of microphone status indicator. i3xrocks.action.volume.scrolldn Override command to run on scroll down of microphone status indicator. i3xrocks.action.disk-capacity Override command to run on disk capacity status indicator. i3xrocks.action.cpu-usage Override command to run on cpu usage status indicator. i3xrocks.action.memory Override command to run on memory status indicator. i3xrocks.action.wifi Override command to run on wifi status indicator. i3xrocks.action.weather Override command to run on weather status indicator. i3xrocks.action.media-player.left Optional command to run on left button click of media player status indicator. i3xrocks.action.media-player.middle Optional command to run on middle button click of media player status indicator. i3xrocks.action.media-player.right Override command to run on right button click of media player status indicator. i3xrocks.action.time Override command to run on date time status indicator. i3xrocks.action.battery Override command to run on battery status indicator. "},"title":"Xresources"},"/de/docs/using-regolith/":{"data":{"":"Explore the following sections to learn how to use Regolith:\nInstall First Launch Basic Usage Configuration "},"title":"Using Regolith"},"/de/docs/using-regolith/basics/":{"data":{"":"Während wir in anderen Bereichen der Dokumentation alles detaillierter behandeln werden, deckt diese Seite die grundlegende Verwendung von Regolith ab.","arbeitsbereiche-wechseln#Arbeitsbereiche wechseln":"Eine primäre Möglichkeit, die Belegung des Bildschirms durch Anwendungen zu verwalten, ist die Verwendung von Arbeitsbereichen (Workspaces). Ein Arbeitsbereich ist im Wesentlichen eine Gruppe von null oder mehr Anwendungen, die alle Fenster auf demselben virtuellen Bildschirm darstellen. Benutzer können zwischen Arbeitsbereichen wechseln, um mehr Platz für Anwendungen zu gewinnen. Fenster können zwischen Arbeitsbereichen verschoben werden. Arbeitsbereiche können an eine physische Anzeige gebunden sein oder nach Bedarf auf andere Anzeigen verschoben werden. Um den Arbeitsbereich zu wechseln, halten Sie die Taste super gedrückt und drücken Sie eine der Zifferntasten. Dadurch wird zu diesem Arbeitsbereich navigiert. Wenn in einem bestimmten Arbeitsbereich ein Fenster vorhanden ist, wird es in der Leiste als aktiv angezeigt. So kann der Benutzer anhand der Leiste erkennen, in welchen Arbeitsbereichen sich aktive Anwendungen befinden.\nArbeitsbereiche können auch mit super tab und super shift tab vor- und zurückgeblättert werden.","beenden-einer-anwendung#Beenden einer Anwendung":"Mit super shift q wird die fokussierte Anwendung beendet. Bei fehlerhaften Anwendungen wird super alt q das Beenden der fokussierten Anwendung erzwingen, aber beachten Sie, dass ungespeicherte Daten verloren gehen können.","browser#Browser":"Der bevorzugte Browser ist ebenfalls eine spezielle Anwendung und kann mit super shift enter gestartet werden.","das-system-konfigurieren#Das System konfigurieren":"Die Einstellungs-App (auch bekannt als regolith-control-center) ist die primäre Schnittstelle für allgemeine Konfigurationsaufgaben, wie die Konfiguration von WiFi und Bluetooth, die Konfiguration von App-Zuordnungen und die Einrichtung von Benutzern. Die App kann über die super c Tastenkombination oder vom Launcher aus über die App Regolith Settings gestartet werden.","einen-neuen-arbeitsbereich-erstellen#Einen neuen Arbeitsbereich erstellen":"Arbeitsbereiche (in manchen Desktop-Umgebungen auch als “virtuelle Desktops” bezeichnet) sind eine der wichtigsten Möglichkeiten, um Fenster zu verwalten. Jeder Arbeitsbereich bietet einen Bildschirm für einen unabhängigen Satz von Fenstern. Um einen Arbeitsbereich zu erstellen oder zu einem bestehenden Arbeitsbereich zu navigieren, geben Sie seinen Index mit den Tasten super 0-9 an.","starten-einer-anwendung#Starten einer Anwendung":"Nach der ersten Anmeldung enthält der Bildschirm eine Leiste am unteren Rand und einige Tastaturkürzel in einem Dialog. Dieser Dialog soll dem Benutzer helfen, Tastenkombinationen für verschiedene Aktionen in der Desktop-Umgebung zu finden und zu speichern. Er kann mit der Taste esc verlassen und mit super shift ?. Um eine Anwendung zu starten, drücken Sie super space und ein ähnlicher Dialog wird mit den auf dem System installierten Anwendungen geladen. Wenn Sie beginnen, den Namen der Anwendung, die Sie starten möchten, einzugeben, wird die Liste auf die passenden Anwendungen eingeschränkt. Sie können auch mit den Pfeiltasten durch die Liste blättern.","suchen-und-starten-einer-datei#Suchen und Starten einer Datei":"Die Suche nach einer bestimmten Datei auf Ihrem lokalen Computer kann auf verschiedene Weise erfolgen. Regolith bietet einen Dateisuchdialog über super alt space zum schnellen Suchen und optionalen Laden einer Datei mit seiner Standardanwendung. Durch Drücken der Eingabetaste bei einer Auswahl wird die Datei mit dem Befehl xdg-open aufgerufen.","tastenkombinationen-anzeigen#Tastenkombinationen anzeigen":"Alle vom Regolith-Desktop verwendeten Tastenkombinationen können mit ilia eingesehen, sortiert und ausgeführt werden. Dieser Dialog wird mit super shift ? aktiviert.","terminal#Terminal":"Das Terminal ist eine spezielle Anwendung, die ihre eigene Tastenkombination hat, super enter.","verwalten-von-benachrichtigungen#Verwalten von Benachrichtigungen":"Das Desktop-Benachrichtigungssystem von Regolith wurde entwickelt, um Pop-ups zu verhindern, die den Benutzer von seiner Arbeit ablenken könnten. Benachrichtigungen können über super n eingesehen und verwaltet werden. Spezielle Tastenkombinationen, wie z.B. das Löschen einer oder mehrerer Benachrichtigungen, finden Sie auf der Registerkarte “Hilfe” des Dialogs. Für Benutzer, die eine bessere Sichtbarkeit der aktuellen Benachrichtigungen wünschen, kann der Statusindikator i3xrocks-rofication über den Systempaketmanager installiert werden. Damit wird die Anzahl der kritischen und normalen ungelesenen Benachrichtigungen in der Leiste angezeigt.","zu-einem-fenster-navigieren#Zu einem Fenster navigieren":"Um eine laufende Anwendung zu fokussieren, kann die super ctrl space Tastenkombination verwendet werden, um einen Dialog mit allen laufenden Fenstern anzuzeigen. Wählen Sie einfach das gewünschte Fenster aus, und das System wechselt in den Arbeitsbereich des Fensters und aktiviert dessen Fokus."},"title":"Grundlegende Verwendung"},"/de/docs/using-regolith/configuration/":{"data":{"":"","empfohlene-pakete-für-neue-benutzer#Empfohlene Pakete für neue Benutzer":"Looks Installieren Sie alle offiziellen Regolith-Looks:\nsudo apt install regolith-look-* Status-Indikatoren Das folgende Snippet installiert Statusindikatoren-Pakete, die für neue Benutzer empfohlen werden:\nsudo apt install i3xrocks-focused-window-name i3xrocks-rofication i3xrocks-info i3xrocks-app-launcher i3xrocks-memory Um einen dieser Indikatoren später zu entfernen, deinstallieren Sie ihn einfach von Ihrem System. Beispiel:\nsudo apt remove i3xrocks-info Laptop-Akkustatus Zeigt den aktuellen Batteriestatus eines Laptops an:\nsudo apt install i3xrocks-battery ","hintergrundbild#Hintergrundbild":"Die meisten Regolith Looks bieten eine Standard-Desktop-Farbe oder ein Bild. Das Hintergrundbild kann durch Angabe des Pfades zum Hintergrundbild über den Xresources-Parameter regolith.wallpaper.file festgelegt werden.\nBeispiel: Angenommen, die Datei /usr/share/backgrounds/hardy_wallpaper_uhd.png ist vorhanden:\necho \"regolith.wallpaper.file: /usr/share/backgrounds/hardy_wallpaper_uhd.png\" \u003e\u003e ~/.config/regolith3/Xresources regolith-look refresh Um die Darstellung (Zoom, Skalierung, etc.) des Hintergrundbildes zu ändern, setzen Sie regolith.wallpaper.options. Optionen sind: none, wallpaper, centered, scaled, stretched, zoom, spanned\nBeispiel:\necho \"regolith.wallpaper.options: zoom\" \u003e\u003e ~/.config/regolith3/Xresources regolith-look refresh Um eine Farbe anstelle eines Bildes anzugeben, verwenden Sie den Xresource-Parameter regolith.wallpaper.color.primary:\necho \"regolith.wallpaper.file: \" \u003e\u003e ~/.config/regolith3/Xresources echo \"regolith.wallpaper.color.primary: blue\" \u003e\u003e ~/.config/regolith3/Xresources regolith-look refresh Um eine sekundäre Farbe und einen Farbverlauf zu definieren:\necho \"regolith.wallpaper.file: \" \u003e\u003e ~/.config/regolith3/Xresources echo \"regolith.wallpaper.color.primary: blue\" \u003e\u003e ~/.config/regolith3/Xresources echo \"regolith.wallpaper.color.secondary: green\" \u003e\u003e ~/.config/regolith3/Xresources echo \"regolith.wallpaper.color.shading.type: vertical\" \u003e\u003e ~/.config/regolith3/Xresources regolith-look refresh Sperrbildschirm-Hintergrundbild Das Hintergrundbild des Sperrbildschirms kann auf die gleiche Weise wie das Desktop-Hintergrundbild verwaltet werden. Die Parameter sind die gleichen wie beim Desktop-Hintergrundbild, aber mit dem Präfix lockscreen vor wallpaper, etwa so: regolith.lockscreen.wallpaper.... Um zum Beispiel ein Bild für den Sperrbildschirm anzugeben:\necho \"regolith.lockscreen.wallpaper.file: /usr/share/backgrounds/hardy_wallpaper_uhd.png\" \u003e\u003e ~/.config/regolith3/Xresources regolith-look refresh Deaktivieren der Wallpaper-Verwaltung Wenn Sie das Hintergrundbild außerhalb von Regolith verwalten möchten, geben Sie einfach leere Werte für das Hintergrundbild und die Farbe an:\necho \"regolith.wallpaper.file: \" \u003e\u003e ~/.config/regolith3/Xresources echo \"regolith.wallpaper.color.primary: \" \u003e\u003e ~/.config/regolith3/Xresources ","i3-features#i3 Features":"Seit Regolith 2.0 werden viele Aspekte der i3-Konfiguration über den Paketmanager verwaltet. Mit i3 4.20 wurde die Möglichkeit eingeführt, Include-Dateien als Teil der Konfiguration anzugeben. Regolith stellt seine gesamte i3-Konfiguration über diese Dateien bereit, die auch “config partials” genannt werden. Diese Pakete installieren ihre i3-Konfigurationspartials in /usr/share/regolith/i3/config.d. Durch das Installieren und Entfernen von Paketen kann die i3-Konfiguration an die eigenen Vorlieben angepasst werden, während gleichzeitig die Upstream-Änderungen für Aspekte der Konfiguration, die sich nicht ändern müssen, unverändert bleiben können. Wenn das Paket regolith-desktop installiert wird, werden diese Konfigurationselemente standardmäßig auch als Soft-Dependencies installiert:\nPaket Funktion regolith-i3-base-launchers Terminal und Browser starten regolith-i3-default-style Fensterverhalten regolith-i3-navigation Navigationstastenbelegung regolith-i3-networkmanager Netzwerk- und WiFi-Funktionen regolith-i3-next-workspace Arbeitsbereich-Dienstprogramm regolith-i3-resize Tastaturbelegung Größenänderung regolith-i3-session Tastaturbelegung Session regolith-i3-unclutter Mauszeiger ausblenden, wenn er nicht benutzt wird regolith-i3-user-programs Optionales Starten von Benutzerprogrammen, die in Xresources angegeben sind regolith-i3-workspace-config Tastaturbelegung des Arbeitsbereichs Soft-Abhängigkeiten können entfernt werden, ohne dass Pakete entfernt werden, die davon abhängen. Dies bedeutet, dass jedes der aufgelisteten Pakete entfernt werden kann. Benutzer können Änderungen an der Konfiguration auf solidere Weise vornehmen, indem sie einen Teil der Standardkonfiguration durch ihre eigene Version ersetzen. Dies kann erreicht werden, indem man den Teil, der angepasst werden soll, nach ~/.config/regolith3/i3/config.d/ kopiert und die Originaldatei in /usr/share/regolith/i3/config.d über apt entfernt. Zum Beispiel, um die Tastaturbelegung des Arbeitsbereichs anzupassen:\nmkdir -p ~/.config/regolith3/i3/config.d cp /usr/share/regolith/i3/config.d/40_workspace-config ~/.config/regolith3/i3/config.d/ vim ~/.config/regolith3/i3/config.d/40_workspace-config # gewünschte Änderungen vornehmen sudo apt remove regolith-i3-workspace-config # Entfernt die Standardversion # Starte i3 neu oder logge dich wieder ein Auf diese Weise können die unveränderten Teilkonfigurationen weiterhin Updates und Fehlerbehebungen erhalten, ohne die benutzerspezifische Konfiguration zu beeinflussen.\nAlle i3-Konfigurationspakete Im Folgenden finden Sie eine Liste aller i3-Konfigurationspakete, die in Regolith 2.0 verfügbar sind:\nPaket Funktion regolith-i3-base-launchers Terminal und Browser starten regolith-i3-compositor Compositor-Integration (delegiert an regolith-compositor-\u003cvariant\u003e) regolith-i3-default-style Fensterverhalten regolith-i3-ftue Hilfe für neue User regolith-i3-gaps-partial i3-gaps Konfiguration (wenn installiert, ersetzt i3-gaps i3) regolith-i3-gnome Regolith-Einstellungen regolith-i3-i3xrocks Konfiguration der i3-Balkenstatusanzeigen regolith-i3-ilia ilia Einbindung regolith-i3-navigation Tastaturbelegung für die Navigation regolith-i3-networkmanager “netzwerk-manager”-Einbindung regolith-i3-next-workspace Funktion zum automatischen Erstellen des nächsten Arbeitsbereichs regolith-i3-remontoire Integration der Ansicht “Legacy keybindings” regolith-i3-resize Tastaturbelegung für Größenänderung regolith-i3-rofi Integration des alten Desktop-Startprogramms regolith-i3-rofication Integration der alten Benachrichtigungsanzeige regolith-i3-rofication-ilia Integration der Benachrichtigungsanzeige regolith-i3-session Tastaturbelegung der Session regolith-i3-snapshot i3-Arbeitsbereichspersistenz regolith-i3-unclutter Ausblenden der Maus bei Nichtgebrauch regolith-i3-user-programs Optionaler Start von Benutzerprogrammen, die in Xresources angegeben sind regolith-i3-workspace-config Arbeitsbereich-Tastaturbelegung ","looks-1#Looks":"Farben, Hintergrundbilder, Fenster- und Leistenlayouts und andere visuelle Faktoren werden in Regolith gebündelt und als “Looks” bezeichnet. Looks bieten eine einfache Möglichkeit, das gesamte Aussehen des Desktops zu ändern. Wie die Statusleistenindikatoren werden auch die Looks in Paketen zusammengefasst und wie jedes andere Softwarepaket installiert und entfernt. Look-Pakete haben das folgende Namensformat: regolith-look-\u003cname\u003e. Um nach verfügbaren Looks zu suchen, kann apt oder ein GUI-Paketmanager verwendet werden. Zur Auswahl eines installierten Looks wird mit der Tastenkombination super alt l ein Dialog angezeigt:\nAlternativ kann der Terminalbefehl regolith-look verwendet werden, um das Aussehen zu ändern und die aktive Sitzung mit dem ausgewählten Aussehen zu aktualisieren. Hier ist ein Beispiel, das zum gruvbox-Look wechselt:\n$ apt search ^regolith-look- [...] regolith-look-gruvbox/unknown,now 0.4.6-1regolith amd64 [...] $ sudo apt install regolith-look-gruvbox regolith-look set gruvbox regolith-look refresh Um einfach alle verfügbaren Looks zu installieren:\nsudo apt install regolith-look-* ","statusleisten-anzeigen#Statusleisten-Anzeigen":"Statusanzeigen wie CPU-Auslastung, Datum und Uhrzeit, Benachrichtigungen, Wetter und andere Systeminformationen können durch die Installation von Paketen hinzugefügt oder entfernt werden. Um zum Beispiel eine Statusanzeige für die Batterie Ihres Laptops anzuzeigen, führen Sie einfach sudo apt install i3xrocks-battery aus und aktualisieren Sie dann die Sitzung mit regolith-look refresh. Um herauszufinden, welche Indikatoren verfügbar sind, führen Sie apt search ^i3xrocks- aus oder suchen Sie nach i3xrocks- in Ihrer bevorzugten Paketmanager-GUI, wie zum Beispiel Synaptic. Es gibt weitere Dokumentation für die Konfiguration von Statusanzeigen, auch “blocklets” genannt.","systemverwaltung#Systemverwaltung":"Die App regolith-control-center ist das Werkzeug zum Konfigurieren von Gebietsschema, Datum, Anzeigen, Netzwerk und verschiedenen anderen Einstellungen. Starten Sie sie über den App-Launcher mit super space, geben Sie settings ein und drücken Sie Enter, um die App zu starten. Die direkte Tastaturbelegung ist super c. Die Anwendung kann auch von einem Terminal mit dem Befehl regolith-control-center gestartet werden.","tastaturbelegungen#Tastaturbelegungen":" Regolith version 3.0 onward replaces “i3-wm” with “wm” in Xresource keys. The content on this page has been updated for Regolith 3.0+. If you are using an earlier version, use “i3-wm” instead of “wm” in the key names below. For example wm.foo.bar changes to i3-wm.foo.bar for Regolith 1.x and 2.x. Die häufigste Änderung der Tastaturbelegung ist die Taste super. Regolith verwendet Xresources als kanonische Quelle für Einstellungen, die von verschiedenen UI-Komponenten gelesen werden. Die Tabelle der Xresources -Parameter, für die Benutzerkonfiguration ist an anderer Stelle verfügbar. Um die Tastaturbelegung super von der Taste “windows” auf “alt” zu ändern, fügen Sie die folgende Zeilen in die Datei ~/.config/regolith3/Xresources ein:\n~/.config/regolith3/Xresourceswm.mod: Mod1 wm.alt: Mod4 Anmerkung: GNOME hat auch seinen eigenen Satz von Tastaturbelegungen. Wenn die Regolith-Sitzung zum ersten Mal initialisiert wird, werden die kollidierenden GNOME-Tastaturbelegungen aus den Benutzereinstellungen entfernt. GNOME-Tastaturbelegungen können in der Regolith-Einstellungs-App verwaltet werden.","weitere-lektüre#Weitere Lektüre":"Wenn Sie tiefer einsteigen wollen, finden Sie die verfügbaren Howtos oder lesen Sie die Xresources reference. Werden Sie ein i3-Poweruser, indem Sie das Benutzerhandbuch lesen."},"title":"Konfiguration"},"/de/docs/using-regolith/first-launch/":{"data":{"":"Die Standardoberfläche von Regolith enthält keine visuellen Hinweise darauf, wie man Anwendungen startet oder andere gängige Aufgaben ausführt. Dies kann beim ersten Mal etwas verwirrend sein. Die Verwendung der Regolith-Benutzeroberfläche ist jedoch relativ einfach, wenn man sich nur die folgenden zwei Tastenkombinationen merkt:\nAktion Tastenkombination Zweck Keybinding Viewer super shift ? Verfügbare Keybindings anzeigen und ausführen App Launcher super space Starten einer Desktop-Anwendung Wenn Sie eine dieser Tastenkombinationen eingeben, wird ein Startdialog auf dem fokussierten Monitor angezeigt. Beide Dialoge verhalten sich gleich.\nDer Dialog hat oben ein Texteingabe-Widget, gefolgt von einem Auswahl-Widget. Das allgemeine Nutzungsmuster für diese Dialoge ist die Auswahl eines Elements aus der angezeigten Liste. Beginnen Sie zu tippen, um die Auswahl zu filtern, und verwenden Sie die Pfeiltasten, um eine Auswahl zu treffen. Durch Drücken von Enter wird das ausgewählte Element aktiviert. Bei Tastenkombinationen bedeutet dies, dass eine Tastenkombination manuell ausgeführt wird. Bei Anwendungen wird die ausgewählte Anwendung gestartet.","anwendungsstarter#Anwendungsstarter":"\nEine grundlegende Aufgabe jeder Desktop-Umgebung ist es, den Benutzern das Starten von Anwendungen zu ermöglichen. In Regolith wird dies über den Anwendungsstarter-Dialog realisiert. Wie bei den Tastenkombinationen zeigt der Dialog zunächst eine Liste aller verfügbaren Desktop-Anwendungen an. Beginnen Sie zu tippen, um die Auswahl zu filtern und verwenden Sie die Pfeiltasten, um eine bestimmte Auswahl zu treffen. Drücken Sie Enter, um die ausgewählte Anwendung zu starten.","die-super-taste#Die Super-Taste":"Die meisten Tastenkombinationen, die Sie mit Regolith verwenden werden, beginnen mit der Taste super. Auf dieser Taste steht in der Regel “WIN” oder es ist ein MS-Windows-Logo abgebildet. Auf einem Mac ist es die Befehlstaste ⌘-Taste. In Zukunft wird diese Taste einfach als super bezeichnet, aber denken Sie daran, dass Sie die physische Taste super in Ihrer Konfiguration ändern können, wenn Sie das möchten.","keybinding-viewer#Keybinding-Viewer":"\nDer Zweck des Keybinding Viewers ist es, das Auffinden und Erlernen der Regolith-Keybindings schnell und einfach zu machen. Eine Referenz zu den Keybindings ist auf dieser Seite verfügbar, aber es ist schneller, einfach den Dialog aufzurufen und nach der gewünschten Aktion zu suchen. Einmal gefunden, kann die Tastenkombination entweder über die Tastatur oder durch Auswahl des Elements im Dialogfeld ausgeführt werden.","nächste-schritte#Nächste Schritte":"Werfen Sie einen Blick auf die Seite basics, um mehr über die Regolith-Schnittstelle zu erfahren."},"title":"Erster Start"},"/de/docs/using-regolith/install/":{"data":{"":"","anatomy-of-the-regolith-apt-url-path#Anatomy of the Regolith \u003ccode\u003eapt\u003c/code\u003e URL Path":"Upgrading to 3.x If you’re upgrading from an earlier version of Regolith, you may be interested in reading the release notes and if coming from 2.x, the migration guide.\nSupported Operating Systems Ubuntu Ubuntu 24.04Ubuntu 22.04 Regolith can be installed as system packages. This makes updating and removing easier and more consistent. The following steps describe how to configure your system to read packages from the Regolith package repository and install the desktop package.\nRegister the Regolith public key to your local apt:\nwget -qO - https://regolith-desktop.org/regolith.key | \\ gpg --dearmor | sudo tee /usr/share/keyrings/regolith-archive-keyring.gpg \u003e /dev/null Add the repository URL to your local apt:\necho deb \"[arch=amd64 signed-by=/usr/share/keyrings/regolith-archive-keyring.gpg] \\ https://regolith-desktop.org/release-3_2-ubuntu-noble-amd64 noble main\" | \\ sudo tee /etc/apt/sources.list.d/regolith.list Update apt and install Regolith\nsudo apt update sudo apt install regolith-desktop regolith-session-flashback regolith-look-lascaille System Restart\nThe login manager will need to be restarted for the new desktop session to be recognized. The easiest way of restarting it is to reboot your system.\nReplace amd64 with arm64 in the two places in the above line to install on ARM-based systems. Regolith can be installed as system packages. This makes updating and removing easier and more consistent. The following steps (also available as a downloadable script) describe how to configure your system to read packages from the Regolith package repository and install the desktop package.\nRegister the Regolith public key to your local apt:\nwget -qO - https://regolith-desktop.org/regolith.key | \\ gpg --dearmor | sudo tee /usr/share/keyrings/regolith-archive-keyring.gpg \u003e /dev/null Add the repository URL to your local apt:\necho deb \"[arch=amd64 signed-by=/usr/share/keyrings/regolith-archive-keyring.gpg] \\ https://regolith-desktop.org/release-3_2-ubuntu-jammy-amd64 jammy main\" | \\ sudo tee /etc/apt/sources.list.d/regolith.list Update apt and install Regolith\nsudo apt update sudo apt install regolith-desktop regolith-session-flashback regolith-look-lascaille System Restart\nThe login manager will need to be restarted for the new desktop session to be recognized. The easiest way of restarting it is to reboot your system.\nReplace amd64 with arm64 in the two places in the above line to install on ARM-based systems. Debian Debian TestingDebian Bookworm For Debian users that use the “Testing” release, Regolith can be installed, however there is no “release” version due to the nature of Debian Testing. In order to install Regolith into a Debian Testing instance, the apt line contains testing instead of a release string. For example:\necho deb \"[arch=amd64 signed-by=/usr/share/keyrings/regolith-archive-keyring.gpg] \\ https://regolith-desktop.org/testing-debian-testing-amd64 testing main\" | \\ sudo tee /etc/apt/sources.list.d/regolith.list Otherwise the installation steps are the same as an official Debian release. Note that broken dependencies or components will occur from time to time. If stability is important, consider installing into an officially released version of Debian or Ubuntu.\nRegolith can be installed as system packages. This makes updating and removing easier and more consistent. The following steps (also available as a downloadable script) describe how to configure your system to read packages from the Regolith package repository and install the desktop package.\nRegister the Regolith public key to your local apt:\nwget -qO - https://regolith-desktop.org/regolith.key | \\ gpg --dearmor | sudo tee /usr/share/keyrings/regolith-archive-keyring.gpg \u003e /dev/null Add the repository URL to your local apt:\necho deb \"[arch=amd64 signed-by=/usr/share/keyrings/regolith-archive-keyring.gpg] \\ https://regolith-desktop.org/release-3_2-debian-bookworm-amd64 bookworm main\" | \\ sudo tee /etc/apt/sources.list.d/regolith.list Update apt and install Regolith\nsudo apt update sudo apt install regolith-desktop regolith-session-flashback regolith-look-lascaille System Restart\nThe login manager will need to be restarted for the new desktop session to be recognized. The easiest way of restarting it is to reboot your system.\nReplace amd64 with arm64 in the two places in the above line to install on ARM-based systems. The regolith-desktop package installs a reasonable minimal configuration that should work on most hardware. To add additional package for a richer and more functional environment read Recommended Packages for New Users. The regolith-compositor-picom-glx compositor should work on most computers. If you experience driver or visual issues, try another compositor. Packages Specified at Install Time Starting with Regolith 3.0 it is now possible to select from multiple sessions (X11: regolith-session-flashback, Wayland: regolith-session-sway). Due to this, when installing Regolith 3.2 also specify one or both sessions that you wish to use. Additionally, it’s now possible to specify the Regolith Look at install time, which saves a setup of having to configure it later. Here is the recommended base install for X11 on Debian-based systems:\nsudo apt install regolith-desktop regolith-session-flashback regolith-look-lascaille # ^-- base package ^-- session ^ -- look For the session, you may chose one or both of: regolith-session-flashback (X11), regolith-session-sway (Wayland) For the look, you may chose one from any available look package: regolith-look-ayu-dark regolith-look-ayu-mirage regolith-look-ayu regolith-look-blackhole regolith-look-default-loader regolith-look-default regolith-look-dracula regolith-look-gruvbox regolith-look-i3-default regolith-look-lascaille regolith-look-nevil regolith-look-nord regolith-look-solarized-dark An an example and alternative to the recommendation above, here is the apt line to install the Sway session with the Nord Look:\nsudo apt install regolith-desktop regolith-session-sway regolith-look-nord Anatomy of the Regolith apt URL Path https://regolith-desktop.org/testing-debian-testing-amd64 | | | | | | | * Architecture | | * Distro Version/Codename | * Distro Name * Regolith Stage Regolith Stages Stage URL String Description Experimental experimental Stage for testing experiments Unstable unstable Stage for early development testing Testing testing Stage for late development testing Release X.Y release-X_Y Stage for specific official release Current Release release-current Stage for latest release (floating from release to release) Distro Names Name Description ubuntu The Ubuntu Linux Distribution debian The Debian Linux Distribution Distro Version/Codename These labels are determined by their respective upstream communities. Examples are noble, bookworm, focal.\nArchitecture Name Description amd64 The 64-bit x86 architecture arm64 The 64-bit Arm architecture Examples Description URL The 3.2 release of Regolith on Ubuntu Jammy for amd64 https://regolith-desktop.org/release-3_2-ubuntu-jammy-amd64 The latest release of Regolith on Debian Bookworm for amd64 https://regolith-desktop.org/release-current-debian-bookworm-amd64 Testing repo for Regolith on Debian Testing for arm64 https://regolith-desktop.org/testing-debian-testing-arm64 ","packages-specified-at-install-time#Packages Specified at Install Time":"","release-change-policy#Release Change Policy":"From Regolith 3.0 onward, all releases will use unique names in the package repo URL. This means that users will be in full control of when they wish to upgrade to a new release. Users wishing to have their package manager always install the latest version, a special stage called release-current is provided.","supported-operating-systems#Supported Operating Systems":"","upgrading-to-3x#Upgrading to 3.x":""},"title":"Install"}}